labforward-docker/labforward/app/models/data_point.rb

SELECT "data_points"."point" FROM "data_points" WHERE "data_points"."created_at" BETWEEN ? AND ? ORDER BY "data_points"."created_at" ASC  [["created_at", "2019-10-15 00:00:00"], ["created_at", "2019-10-26 23:59:59.999999"]]
---
  scope :interval_data_points, -> (from, to) do
    where(created_at: from.beginning_of_day..to.end_of_day)
    .order(created_at: :asc)
    .pluck(:point)